[{"user_input": {"genres": ["Aksiyon", "Bilim Kurgu"], "languages": ["English", "Türkçe"], "favorite_movies": ["Star Wars", "Iron Man", "Deadpool"]}, "recommendations": [["1. Guardians of the Galaxy ", " Action, Science Fiction ", " A group of intergalactic misfits team up to protect a powerful orb from falling into the hands of a villainous warlord."], ["2. The Matrix ", " Action, Science Fiction ", " A computer hacker learns the truth about reality and joins a rebellion against sentient machines that have enslaved humanity."], ["3. Avengers: Endgame ", " Action, Science Fiction ", " The Avengers assemble once more to undo the devastating events caused by the villainous Thanos and restore balance to the universe."], ["4. Star Trek ", " Action, Science Fiction ", " The crew of the starship Enterprise embarks on a mission to explore new worlds and encounter alien species while upholding the values of the Federation."], ["5. Elysium ", " Action, Science Fiction ", " In a dystopian future where the wealthy live on a luxurious space station, a man seeks to reach Elysium to access life-saving medical technology for himself and others on Earth."]]}, {"user_input": {"genres": ["Komedi", "Romantik"], "languages": ["English"], "favorite_movies": ["Titanic", "The Notebook", "Me before you"]}, "recommendations": [["1. Love, Rosie ", " Romantic Comedy ", " Follows the lifelong friendship and romance between Rosie and Alex, who are separated by circumstances but always find their way back to each other."], ["2. Crazy, Stupid, Love ", " Romantic Comedy ", " A man's life changes after being taught how to pick up women by a smooth-talking ladies' man, leading to unexpected romantic entanglements."], ["3. Notting Hill ", " Romantic Comedy ", " A charming romance blossoms between a famous actress and a humble bookstore owner in London, despite the challenges of their different lifestyles."], ["4. The Proposal ", " Romantic Comedy ", " A high-powered book editor forces her assistant to marry her in order to avoid deportation back to Canada, leading to unexpected romantic developments."], ["5. 10 Things I Hate About You ", " Romantic Comedy ", " A modern retelling of Shakespeare's \"The Taming of the Shrew,\" where a high school bad boy tries to win over a feisty girl in order to date her sister."]]}, {"user_input": {"genres": ["Aksiyon"], "languages": ["English"], "favorite_movies": ["Sherlock Holmes", "Enola Holmes", "John Wick"]}, "recommendations": [["1. The Dark Knight ", " Action ", " In this action-packed film, Batman sets out to protect Gotham City from the chaos caused by the infamous Joker."], ["2. Mad Max: Fury Road ", " Action ", " A high-octane thrill ride set in a post-apocalyptic world, where a woman rebels against a tyrannical leader in search of her homeland."], ["3. Kingsman: The Secret Service ", " Action ", " A spy organization recruits a promising street kid into their training program, leading to a dangerous mission to save the world."], ["4. Die Hard ", " Action ", " NYPD officer John McClane battles a group of terrorists who have taken over a Los Angeles skyscraper during a Christmas party."], ["5. The Bourne Identity ", " Action ", " A man suffering from amnesia discovers he is a skilled assassin, and must evade capture while uncovering his true identity."]]}, {"user_input": {"genres": ["Aksiyon", "Komedi"], "languages": ["English"], "favorite_movies": ["Rush Hour", "The Karate Kid", "The Forbidden Kingdom"]}, "recommendations": [["1. Shanghai Noon ", " Action, Comedy ", " A Chinese Imperial Guard teams up with a cowboy to rescue the princess of the Forbidden City."], ["2. 21 Jump Street ", " Action, Comedy ", " Two unlikely police officers go undercover as high school students to bust a drug ring."], ["3. Kung Fu Panda ", " Action, Comedy ", " A clumsy panda becomes the Dragon Warrior and must protect his village from an evil snow leopard."], ["4. Central Intelligence ", " Action, Comedy ", " A mild-mannered accountant is lured into the world of espionage by a former high school classmate who is now a CIA agent."], ["5. The Other Guys ", " Action, Comedy ", " Two mismatched detectives stumble upon a case that leads them into a dangerous world of corporate crime."]]}]